# A = [[9,5,4,5,1,0,0,0],
#      [7,1,3,6,0,1,0,0],
#      [5,8,5,5,0,0,1,0],
#      [1,2,2,3,0,0,0,1]]

A = [[-1,-1,-1,-2,1,0,0,0],
     [2, 3, 4, 3, 0,1,0,0],
     [-2, 0, 1,-6,0,0,1,0],
     [-2,-2,-3,-3,0,0,0,1]]

n = len(A)

for k in range(n):
    if abs( A[k][k] ) < 0.00001 :
        m = k + 1
        # Нахождение строки с ненулевым элементом
        while ((abs(A[m][k]) > 0.00001) or (m > n) != True):
               m = m + 1
        # Прибавление строки с номером m к строке с номером k
        for j in range(2 * n):
               A[k][j] = A[k][j] + A[m][j]
    # Элементы, находящиеся правее столбца с номером k, но не в строке с номером k
    for i in range(n):
               for j in range(k + 1, 2 * n):
                   if i != k: A[i][j] = (A[i][j] * A[k][k] - A[k][j] * A[i][k]) / A[k][k]
    # Обнулить все элементы в столбце с номером k, кроме элемента A[k][k]
    for i in range(n):
        if i != k: A[i][k] = 0
    # Все элементы в строке с номером k по убыванию поделить на A[k][k]
    for j in range(2 * n -1, k-1, -1):
        A[k][j] = A[k][j] / A[k][k]

# Вывод 
for i in range (n):
    for j in range (n * 2):
        print('{:2.0f}'.format( A[i][j] ), end = "  " )
    print ()

